Repository: debian-live/live-build
Catalog: manpages/po/*/*-chroot-hooks.1.po
Languages: de

source: Live Systems Project
de: Live Systems Projekt

source: B<live-build> - Live System Build Components
de: B<live-build> - System Build Komponenten

source: SYNOPSIS
de: SYNTAX

source: DESCRIPTION
de: BESCHREIBUNG

source: live-build contains the components to build a live system from a configuration directory.
de: live-build enthält die Komponenten um ein Live System von einem Konfigurationsverzeichnis zu erstellen.

source: SPECIFICATION
de: SPEZIFIKATION

source: OPTIONS
de: OPTIONEN

source: sets verbose option (default: False).
de: setzt verbose Option für mehr Ausgaben (Standardwert: aus).

source: show help message and exit.
de: zeigt Hilfenachricht und beendet sich.

source: show program's version number and exit.
de: zeigt Versionsnummer des Programms und beendet sich.

source: FILES
de: DATEIEN

source: generic hook files.
de: Allgemeine Hook Dateien.

source: directory in which the hook files are executed.
de: Verzeichnis in dem Hook Dateien ausgeführt werden.

source: directory in which hook files are copied.
de: Verzeichnis in das die Hook Dateien kopiert werden.

source: SEE ALSO
de: SIEHE AUCH

source: More information about live-build and the Live Systems project can be found on the homepage at E<lt>I<http://live-systems.org/>E<gt> and in the manual at E<lt>I<http://live-systems.org/manual/>E<gt>.
de: Weitere Informationen über live-build und das Live Systems Projekt können auf der Homepage unter E<lt>I<http://live-systems.org/>E<gt> und im Handbuch unter E<lt>I<http://live-systems.org/manual/>E<gt> gefunden werden.

source: BUGS
de: FEHLER

source: Bugs can be reported by submitting a bugreport for the live-build package in the Bug Tracking System at E<lt>I<http://bugs.debian.org/>E<gt> or by writing a mail to the Live Systems mailing list at E<lt>I<debian-live@lists.debian.org>E<gt>.
de: Fehler können durch Einreichen eines Fehlerberichtes für das live-build Paket im Bug Tracking System unter E<lt>I<http://bugs.debian.org/>E<gt> oder durch Senden einer E-Mail an die Live Systems Mailing Liste unter E<lt>I<debian-live@lists.debian.org>E<gt> (englischsprachig) mitgeteilt werden.

source: AUTHOR
de: AUTOR

source: live-build was written by Daniel Baumann E<lt>I<mail@daniel-baumann.ch>E<gt>.
de: live-build wurde von Daniel Baumann E<lt>I<mail@daniel-baumann.ch>E<gt> geschrieben.

source: bind mounted configuration directory within the chroot directory to be read by hook files.
de: bind mount des Konfigurationsverzeichnis innerhalb des chroot Verzeichnisses um von Hook Dateien gelesen werden zu können.

source: The B<lb chroot-hooks> command executes hook files after the chroot stage.
de: Der B<lb chroot-hooks> Befehl führt Hook Dateien nach dem Chroot Stage aus.

source: B<lb chroot-hooks> executes any hook files found in the B<config/hooks> directory within the configuration directory.
de: B<lb chroot-hooks> führt alle Hook Dateien die sich im B<config/hooks> Verzeichnis innerhalb des Konfigurationsvereichnisses befinden aus.

source: Hook files do not require to have a specific owner nor specific permissions. They are marked executable by B<lb chroot-hooks> automatically when they are executed.
de: Hook Dateien benötigen weder einen speziellen Besitzer noch spezielle Zugriffsrechte. Sie werden automatisch als ausführbar markiert wenn sie von B<lb chroot-hooks> ausgeführt werden.

source: Hook files must either have the suffix B<*.hook> or B<*.hook.chroot>.
de: Hook Dateien müssen entweder den Suffix B<*.hook> oder B<*.hook.chroot> haben.

source: Hook files with the suffix B<*.hook> are executed first, hook files with the suffix B<*.hook.chroot> are executed second.
de: Hook Dateien mit dem Suffix B<*.hook> werden als erstes ausgeführt, Hook Dateien mit dem Suffix B<*.hook.chroot> als zweites.

source: Hook files are executed in alphanumberical order by B<lb chroot-hooks>. If one hook file depends on being run after another, best practise is to use number prefixes (nnnn, starting with 0001) to ensure the order of execution.
de: Hook Dateien werden von B<lb chroot-hooks> in alphanummerischer Reihenfolge ausgeführt. Falls eine Hook Datei davon abhängt nach einer anderen Hook Datei ausgeführt zu werden, ist die empfohlene Vorgehensweise Nummern als Prefixes (nnnn, beginnend mit 0001) zu benutzen um die Ausführungsreihenfolge zu sichern.

source: Hook files are copied into the B<chroot/live-build> directory by B<lb chroot-hooks>. They are executed from within the chroot directory (chrooted) and can read the configuration directory in B</live-build/config> within the chroot directory.
de: Hook Dateien werden durch B<lb chroot-hooks> in das B<chroot/live-build> Verzeichnis kopiert. Sie werden innerhalb des chroot Verzeichnises ausgeführt und können das Konfigurationsverzeichnis in B</live-build/config> innerhalb des chroot Verzeichnisses lesen.

source: hook files specific for the chroot stage.
de: Hook Dateien spezifisch für den Chroot Stage.
