Repository: debian-live/live-build
Catalog: manpages/po/*/*-source-includes.1.po
Languages: es

source: Live Systems Project
es: Proyecto Live Systems

source: NAME
es: NOMBRE

source: B<live-build> - Live System Build Components
es: B<live-build> - Componentes de Construcción del Sistema en vivo

source: SYNOPSIS
es: SINOPSIS

source: DESCRIPTION
es: DESCRIPCIÓN

source: live-build contains the components to build a live system from a configuration directory.
es: live-build contiene los componentes para construir un sistema en vivo a partir de un directorio de configuración.

source: SPECIFICATION
es: ESPECIFICACIÓN

source: OPTIONS
es: OPCIONES

source: sets verbose option (default: False).
es: establece la opción verbose (por defecto: False).

source: show help message and exit.
es: muestra el mensaje de ayuda y sale.

source: show program's version number and exit.
es: muestra el número de versión del programa y sale.

source: FILES
es: FICHEROS

source: SEE ALSO
es: VER TAMBIÉN

source: HOMEPAGE
es: PÁGINA WEB

source: More information about live-build and the Live Systems project can be found on the homepage at E<lt>I<http://live-systems.org/>E<gt> and in the manual at E<lt>I<http://live-systems.org/manual/>E<gt>.
es: Se puede encontrar más información acerca de live-build y el proyecto Live Systems en la página web E<lt>I<http://live-systems.org/>E<gt> y en el manual en E<lt>I<http://live-systems.org/manual/>E<gt>.

source: BUGS
es: ERRORES

source: Bugs can be reported by submitting a bugreport for the live-build package in the Bug Tracking System at E<lt>I<http://bugs.debian.org/>E<gt> or by writing a mail to the Live Systems mailing list at E<lt>I<debian-live@lists.debian.org>E<gt>.
es: Se puede notificar los fallos enviando un informe de errores sobre el paquete live-build en el Bug Tracking System en E<lt>I<http://bugs.debian.org/>E<gt> o escribiendo un mensaje a la lista de correo de Live Systems a la dirección E<lt>I<debian-live@lists.debian.org>E<gt>.

source: AUTHOR
es: AUTOR

source: live-build was written by Daniel Baumann E<lt>I<mail@daniel-baumann.ch>E<gt>.
es: live-build fue escrito por Daniel Baumann E<lt>I<mail@daniel-baumann.ch>E<gt>.

source: generic include files.
es: ficheros «include» genéricos.

source: directory in which the include files are copied into.
es: directorio en el que se copian los ficheros «include».

source: The B<lb source-includes> command copies include files into the source stage.
es: El comando B<lb source-includes> copia los ficheros «include» durante la etapa «source».

source: B<lb source-includes> copies any include files found in the B<config/includes> and B<config/includes.source> directories within the configuration directory.
es: B<lb source-includes> copia todos los ficheros «include» que encuentra en los directorios B<config/includes> y B<config/includes.source> dentro del directorio de configuración.

source: Include files do not require to have a specific owner nor specific permissions. The files are set to be owned by root by B<lb source-includes> automatically when they are copied, original permissions of the files are preserved. Specific owners can be set with a corresponding hook file, see I<lb-source-hooks>(1) for more information about hooks.
es: No es necesario que los ficheros «include» tengan un propietario o permisos especiales. B<lb source-includes> automáticamente asignará los ficheros al superusuario root en el momento de copiarlos, mientras que los permisos iniciales de los ficheros se mantienen intactos. Se puede establecer propietarios específicos de los ficheros utilizando un script gancho, ver I<lb-source-hooks>(1) para más información acerca de los scripts gancho.

source: Include files in the B<config/includes> directory are copied first, include files in the B<config/includes.source> directory are copied second. Files present in the source and either of the include directories are silently overwritten, the later file replaces the earlier.
es: Los ficheros «include» del directorio B<config/includes> se copian en primer lugar, los del directorio B<config/includes.source> se copian en segundo lugar. Los ficheros existentes en los directorios «source» e «include» se sobreescriben sin previo aviso, el último fichero reemplaza al anterior.

source: include files specific for the source stage.
es: ficheros «include» específicos para la etapa «source».
